using BePro.Website.Public.Helpers;
using BePro.Website.Public.Models;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;
using System.Web.Mvc;

namespace BePro.Website.Public.Controllers
{
    public class NewsController : Controller
    {
        public ActionResult Index(int? page)
        {
            page--;
            var list = new List<NewsListItemViewModel>();
            #region Seed
            list.Add(new NewsListItemViewModel()
            {
                Content = "უჭირთ თუ არა საქართველოში ქალებს სესხის აღება? რამდენად ხშირია სახელმწიფო ბიზნეს-პროგრამებში ქალების ჩართულობა და რა წინააღმდეგობას აწყდებიან ქალები ამ მხრივ? ამ და სხვა საკითხებზე რადიო „კომერსანტის\" გადაცემაში „წარმატებული ქალები\" მეწარმეობის განვითარების სააგენტოს ხელმძღვანელმა ანი კვარაცხელიამ ისაუბრა.",
                ThumbnailUrl = "../../img/news/1.jpg",
                Title = "საქართველოში ქალები ბიზნესში ნაკლებად რისკავენ",
                Date = new DateTime(2016, 9, 30),
                NewsID = 1
            });
            list.Add(new NewsListItemViewModel()
            {
                Content = "ქართველ სამხედროებს საქართველოს თავდაცვის მინისტრი, ლევან იზორია და აშშ-ის ელჩი საქართველოში, იან კელი ალექსეევკის აეროპორტში დახვდნენ. თავდაცვის მინისტრმა და ამერიკის ელჩმა სამხედრო მოსამსახურეებს სამშობლოში მშვიდობიანად დაბრუნება მიულოცეს და სამშვიდობო მისიის წარმატებით შესრულებისთვის მადლობა გადაუხადეს.",
                ThumbnailUrl = "../../img/news/2.jpg",
                Title = "ქართველი სამხედროები ავღანეთიდან დაბრუნდნენ",
                Date = new DateTime(2016, 9, 30),
                NewsID = 2
            });
            list.Add(new NewsListItemViewModel()
            {
                Content = "უჭირთ თუ არა საქართველოში ქალებს სესხის აღება? რამდენად ხშირია სახელმწიფო ბიზნეს-პროგრამებში ქალების ჩართულობა და რა წინააღმდეგობას აწყდებიან ქალები ამ მხრივ? ამ და სხვა საკითხებზე რადიო „კომერსანტის\" გადაცემაში „წარმატებული ქალები\" მეწარმეობის განვითარების სააგენტოს ხელმძღვანელმა ანი კვარაცხელიამ ისაუბრა.",
                ThumbnailUrl = "../../img/news/1.jpg",
                Title = "საქართველოში ქალები ბიზნესში ნაკლებად რისკავენ",
                Date = new DateTime(2016, 9, 30),
                NewsID = 3
            });
            list.Add(new NewsListItemViewModel()
            {
                Content = "უჭირთ თუ არა საქართველოში ქალებს სესხის აღება? რამდენად ხშირია სახელმწიფო ბიზნეს-პროგრამებში ქალების ჩართულობა და რა წინააღმდეგობას აწყდებიან ქალები ამ მხრივ? ამ და სხვა საკითხებზე რადიო „კომერსანტის\" გადაცემაში „წარმატებული ქალები\" მეწარმეობის განვითარების სააგენტოს ხელმძღვანელმა ანი კვარაცხელიამ ისაუბრა.",
                ThumbnailUrl = "../../img/news/1.jpg",
                Title = "საქართველოში ქალები ბიზნესში ნაკლებად რისკავენ",
                Date = new DateTime(2016, 9, 30),
                NewsID = 4
            });
            list.Add(new NewsListItemViewModel()
            {
                Content = "უჭირთ თუ არა საქართველოში ქალებს სესხის აღება? რამდენად ხშირია სახელმწიფო ბიზნეს-პროგრამებში ქალების ჩართულობა და რა წინააღმდეგობას აწყდებიან ქალები ამ მხრივ? ამ და სხვა საკითხებზე რადიო „კომერსანტის\" გადაცემაში „წარმატებული ქალები\" მეწარმეობის განვითარების სააგენტოს ხელმძღვანელმა ანი კვარაცხელიამ ისაუბრა.",
                ThumbnailUrl = "../../img/news/1.jpg",
                Title = "საქართველოში ქალები ბიზნესში ნაკლებად რისკავენ",
                Date = new DateTime(2016, 9, 30),
                NewsID = 5
            });
            list.Add(new NewsListItemViewModel()
            {
                Content = "უჭირთ თუ არა საქართველოში ქალებს სესხის აღება? რამდენად ხშირია სახელმწიფო ბიზნეს-პროგრამებში ქალების ჩართულობა და რა წინააღმდეგობას აწყდებიან ქალები ამ მხრივ? ამ და სხვა საკითხებზე რადიო „კომერსანტის\" გადაცემაში „წარმატებული ქალები\" მეწარმეობის განვითარების სააგენტოს ხელმძღვანელმა ანი კვარაცხელიამ ისაუბრა.",
                ThumbnailUrl = "../../img/news/1.jpg",
                Title = "საქართველოში ქალები ბიზნესში ნაკლებად რისკავენ",
                Date = new DateTime(2016, 9, 30),
                NewsID = 6
            });
            #endregion
            #region Seed
            list.Add(new NewsListItemViewModel()
            {
                Content = "უჭირთ თუ არა საქართველოში ქალებს სესხის აღება? რამდენად ხშირია სახელმწიფო ბიზნეს-პროგრამებში ქალების ჩართულობა და რა წინააღმდეგობას აწყდებიან ქალები ამ მხრივ? ამ და სხვა საკითხებზე რადიო „კომერსანტის\" გადაცემაში „წარმატებული ქალები\" მეწარმეობის განვითარების სააგენტოს ხელმძღვანელმა ანი კვარაცხელიამ ისაუბრა.",
                ThumbnailUrl = "../../img/news/1.jpg",
                Title = "საქართველოში ქალები ბიზნესში ნაკლებად რისკავენ",
                Date = new DateTime(2016, 9, 30),
                NewsID = 1
            });
            list.Add(new NewsListItemViewModel()
            {
                Content = "ქართველ სამხედროებს საქართველოს თავდაცვის მინისტრი, ლევან იზორია და აშშ-ის ელჩი საქართველოში, იან კელი ალექსეევკის აეროპორტში დახვდნენ. თავდაცვის მინისტრმა და ამერიკის ელჩმა სამხედრო მოსამსახურეებს სამშობლოში მშვიდობიანად დაბრუნება მიულოცეს და სამშვიდობო მისიის წარმატებით შესრულებისთვის მადლობა გადაუხადეს.",
                ThumbnailUrl = "../../img/news/2.jpg",
                Title = "ქართველი სამხედროები ავღანეთიდან დაბრუნდნენ",
                Date = new DateTime(2016, 9, 30),
                NewsID = 2
            });
            list.Add(new NewsListItemViewModel()
            {
                Content = "უჭირთ თუ არა საქართველოში ქალებს სესხის აღება? რამდენად ხშირია სახელმწიფო ბიზნეს-პროგრამებში ქალების ჩართულობა და რა წინააღმდეგობას აწყდებიან ქალები ამ მხრივ? ამ და სხვა საკითხებზე რადიო „კომერსანტის\" გადაცემაში „წარმატებული ქალები\" მეწარმეობის განვითარების სააგენტოს ხელმძღვანელმა ანი კვარაცხელიამ ისაუბრა.",
                ThumbnailUrl = "../../img/news/1.jpg",
                Title = "საქართველოში ქალები ბიზნესში ნაკლებად რისკავენ",
                Date = new DateTime(2016, 9, 30),
                NewsID = 3
            });
            list.Add(new NewsListItemViewModel()
            {
                Content = "უჭირთ თუ არა საქართველოში ქალებს სესხის აღება? რამდენად ხშირია სახელმწიფო ბიზნეს-პროგრამებში ქალების ჩართულობა და რა წინააღმდეგობას აწყდებიან ქალები ამ მხრივ? ამ და სხვა საკითხებზე რადიო „კომერსანტის\" გადაცემაში „წარმატებული ქალები\" მეწარმეობის განვითარების სააგენტოს ხელმძღვანელმა ანი კვარაცხელიამ ისაუბრა.",
                ThumbnailUrl = "../../img/news/1.jpg",
                Title = "საქართველოში ქალები ბიზნესში ნაკლებად რისკავენ",
                Date = new DateTime(2016, 9, 30),
                NewsID = 4
            });
            list.Add(new NewsListItemViewModel()
            {
                Content = "უჭირთ თუ არა საქართველოში ქალებს სესხის აღება? რამდენად ხშირია სახელმწიფო ბიზნეს-პროგრამებში ქალების ჩართულობა და რა წინააღმდეგობას აწყდებიან ქალები ამ მხრივ? ამ და სხვა საკითხებზე რადიო „კომერსანტის\" გადაცემაში „წარმატებული ქალები\" მეწარმეობის განვითარების სააგენტოს ხელმძღვანელმა ანი კვარაცხელიამ ისაუბრა.",
                ThumbnailUrl = "../../img/news/1.jpg",
                Title = "საქართველოში ქალები ბიზნესში ნაკლებად რისკავენ",
                Date = new DateTime(2016, 9, 30),
                NewsID = 5
            });
            list.Add(new NewsListItemViewModel()
            {
                Content = "უჭირთ თუ არა საქართველოში ქალებს სესხის აღება? რამდენად ხშირია სახელმწიფო ბიზნეს-პროგრამებში ქალების ჩართულობა და რა წინააღმდეგობას აწყდებიან ქალები ამ მხრივ? ამ და სხვა საკითხებზე რადიო „კომერსანტის\" გადაცემაში „წარმატებული ქალები\" მეწარმეობის განვითარების სააგენტოს ხელმძღვანელმა ანი კვარაცხელიამ ისაუბრა.",
                ThumbnailUrl = "../../img/news/1.jpg",
                Title = "საქართველოში ქალები ბიზნესში ნაკლებად რისკავენ",
                Date = new DateTime(2016, 9, 30),
                NewsID = 6
            });
            #endregion
            var res = PagedList<NewsListItemViewModel>.Create(list.AsQueryable(), (page ?? 0), 4);
            return View(res);
        }

        public ActionResult Read(int id)
        {
            return View();
        }
    }
}